In [1]:
import pandas as pd
import numpy as np

In [2]:
#case 1
Employee_1=pd.DataFrame({'id':[1,2,3],'salary':[100,300,200]})

In [3]:
Employee_1

   id  salary
0   1     100
1   2     300
2   3     200

In [4]:
if len(sorted(Employee_1['salary'].unique()))>=2:
    print('SecondHighestSalary='+str(sorted(Employee_1['salary'].unique(),reverse=True)[1]))
else:
    print(np.nan)

SecondHighestSalary=200

In [5]:
#unique() to avoid repetitive, reverse=True sorts in descending order

In [6]:
#case 2
Employee_2=pd.DataFrame({'id':[1],'salary':[100]})
Employee_2

   id  salary
0   1     100

In [7]:
if len(sorted(Employee_2['salary'].unique()))>=2:
    print('SecondHighestSalary='+str(sorted(Employee_2['salary'].unique(),reverse=True)[1]))
else:
    print(np.nan)

nan